In [18]:
warnings.filterwarnings('ignore')
pd.set_option('display.max_rows', 20)
pd.set_option('display.max_columns', None)

# **Imports**

In [1]:
from botocore.exceptions import NoCredentialsError, ClientError
from sqlalchemy import create_engine, inspect, text
from yaml.loader import SafeLoader
from dateutil.parser import parse
from sqlalchemy import text
import pandas as pd
import numpy as np
import psycopg2
import warnings
import requests
import tabula
import boto3
import yaml
import s3fs
import re

# **Classes**

In [2]:
class DatabaseConnector():
    def __init__(self, yaml_file):
        self.yaml_file = yaml_file
        self.db_engine = self.init_db_engine(self.read_db_creds())
        self.db_table_list = self.list_db_tables()
        
    def read_rds_table(self, table_name):
        """
        Reads data from a specified table in an RDS database and returns it as a pandas DataFrame.

        Parameters:
        - table_name (str): Name of the table to read from.

        Returns:
        - table_data (pandas DataFrame): Data from the specified table.
        """
        table_data = pd.read_sql_table(table_name, self.db_engine).set_index('index')
        return table_data

    def read_db_creds(self):
        with open(self.yaml_file, 'r') as f:
            db_creds = yaml.safe_load(f)
            return db_creds
    
    def init_db_engine(self, db_creds):
        db_engine = create_engine(f"postgresql://{db_creds['RDS_USER']}:{db_creds['RDS_PASSWORD']}@{db_creds['RDS_HOST']}:{db_creds['RDS_PORT']}/{db_creds['RDS_DATABASE']}")
        return db_engine

    def list_db_tables(self):
        insp = inspect(self.db_engine)
        db_table_list = insp.get_table_names()
        return db_table_list
    
    def upload_to_db(self, dataset_name, dataframe):
        dataframe.to_sql(dataset_name, self.db_engine, if_exists='replace')
        print("CODE: 200 SUCCESS!")

In [26]:
class DataExtractor:
    def __init__(self):
        # Initialize with API key for authentication
        self.api_header = {"x-api-key": "yFBQbwXe9J3sd6zWVAMrK6lcxxr0q1lr2PT6DDMX"}
        
    def extract_from_s3(self, s3_address):
        """
        Args:
            s3_address (str): S3 address of the CSV file.
        Returns:
            pd.DataFrame: Pandas DataFrame containing the extracted data.
        """  
        try:
            # Split S3 address into bucket and key
            bucket, key = s3_address.replace('s3://', '').split('/', 1)

            # Create an S3 client
            s3 = boto3.client('s3')
            
            s3.download_file(bucket, key, "products.csv")
        
        
            return pd.read_csv("products.csv")
    
        except Exception as e:
            print(f"Error extracting data from S3: {e}")
            return None

    def retrieve_pdf_data(self, pdf_path):
        """
        Args:
            pdf_path (str): Path to the PDF file.
        Returns:
            pd.DataFrame: Pandas DataFrame containing the extracted data.
        """
        dfs = tabula.read_pdf(pdf_path, pages='all')
        pdf_df = pd.concat(dfs)
        return pdf_df

    def read_rds_table(self, table_name, database_engine):
        """
        Args:
            table_name (str): Name of the table to read data from.
            database_engine: SQLAlchemy database engine.

        Returns:
            pd.DataFrame: Pandas DataFrame containing the table data.
        """
        table_data = pd.read_sql_table(table_name, database_engine)
        return table_data
    
    
    def retrieve_all_store_data(self):
        arr = []
        for i in range(451):
            store_details_df = self.retrieve_stores_data(i)
            arr.append(store_details_df)
        x = pd.concat(arr)
        return x

    def retrieve_stores_data(self, store_to_extract):
        """
        Args:
            store_to_extract (int): Store number to retrieve details for.
        Returns:
            pd.DataFrame: Pandas DataFrame containing store details data.
        """
        total_num_stores = self.list_number_of_stores()

        if store_to_extract < total_num_stores:
            # Define the API endpoint for store details
            store_details_endpoint = 'https://aqj7u5id95.execute-api.eu-west-1.amazonaws.com/prod/store_details/'
            store_details_response = requests.get(f'{store_details_endpoint}{store_to_extract}', headers=self.api_header)

            if store_details_response.status_code == 200:
                store_details_df = pd.DataFrame([store_details_response.json()])
                del store_details_df['index']
                return store_details_df
            else:
                print(f"Request failed with status code: {store_details_response.status_code}")
        else:
            print("Store number is invalid")

    def list_number_of_stores(self):
        """
        Retrieve the total number of stores from an API.
        Returns:
            int: Total number of stores.
        """
        number_stores_endpoint_url = 'https://aqj7u5id95.execute-api.eu-west-1.amazonaws.com/prod/number_stores'
        number_stores_response = requests.get(number_stores_endpoint_url, headers=self.api_header)

        if number_stores_response.status_code == 200:
            number_stores_data = number_stores_response.json()
            return number_stores_data['number_stores']
        else:
            print(f"Request failed with status code: {number_stores_response.status_code}")

In [47]:
class DataCleaning():
    def __init__(self, dataframe):
        # Constructor: Initializes with a DataFrame
        self.dataframe = dataframe
        
    def clean_staff_numbers(self, entry):
        # Clean staff numbers in the DataFrame
        if str(entry).isdigit():
            return int(entry)
        elif len(str(entry)) == 3:
            cleaned_digits = ''
            for char in entry:
                if char.isdigit():
                    cleaned_digits += char
            return int(cleaned_digits)
        else:
            return None

    def clean_continent(self, continent):
        if "ee" in continent:
            continent = continent.replace("ee", "")
            return continent
        else:
            return continent
        
    def clean_store_data(self):
        # A method to perform various data cleaning tasks on the DataFrame
        # Clean continent names in the DataFrame
        self.dataframe['staff_numbers'] = self.dataframe['staff_numbers'].apply(self.clean_staff_numbers)
        # Remove rows with NULL values in the 'staff_numbers' column
        self.dataframe.dropna(subset=['staff_numbers'], inplace=True)
        # Convert 'staff_numbers' column to int64
        self.dataframe["staff_numbers"] = self.dataframe["staff_numbers"].astype("int64")
         # Clean continent names
        self.dataframe["continent"] = self.dataframe["continent"].apply(self.clean_continent)
        self.dataframe =  self.dataframe.drop('lat', axis=1)
        self.dataframe.loc[:,'opening_date'] = pd.to_datetime(self.dataframe['opening_date'].apply(parse))
        self.dataframe.reset_index(drop=True, inplace=True)
        return self.dataframe
                
    def clean_card_data(self):
         # A method to clean card data in the DataFrame
        valid_providers = ['Diners Club / Carte Blanche', 'American Express', 'JCB 16 digit','JCB 15 digit', 'Maestro', 'Mastercard', 'Discover','VISA 19 digit', 'VISA 16 digit', 'VISA 13 digit']
         # Keep rows where 'card_provider' is in the list of valid providers
        self.dataframe = self.dataframe[self.dataframe['card_provider'].isin(valid_providers)]
        self.dataframe.loc[:,'expiry_date'] = pd.to_datetime(self.dataframe['expiry_date'], errors = 'coerce', format='%m/%y')
        #self.dataframe.loc[:,'date_payment_confirmed'] = pd.to_datetime(self.dataframe['date_payment_confirmed'], format='mixed')
        self.dataframe.loc[:, 'card_number'] = self.dataframe['card_number'].apply(lambda x: "".join(filter(str.isdigit, str(x))))
        self.dataframe = self.dataframe = self.dataframe.drop_duplicates()

        
        return self.dataframe

    def remove_null_and_duplicates(self):
        if 'index' in self.dataframe.columns:
            self.dataframe = self.dataframe.set_index('index')
        self.dataframe = self.dataframe[self.dataframe != 'NULL']
        self.dataframe = self.dataframe.drop_duplicates()
        return self.dataframe

    def clean_user_data(self):
        # A method to clean the 'country_code' column in the DataFrame
        self.dataframe['country_code'] = self.dataframe['country_code'].replace('GGB', 'GB')
         # Keep rows where 'country_code' has a length of 2
        self.dataframe = self.dataframe[self.dataframe['country_code'].apply(lambda x: len(str(x)) == 2)]
        # A method to clean date columns in the DataFrame
        self.dataframe.loc[:,'date_of_birth'] = pd.to_datetime(self.dataframe['date_of_birth'].apply(parse))
        self.dataframe.loc[:,'join_date'] = pd.to_datetime(self.dataframe['join_date'].apply(parse))
        # A method to clean phone numbers columns in the DataFrame
        regex = '^(\(?\+?[0-9]*\)?)?[0-9_\- \(\)]*$'
        self.dataframe.loc[:,'phone_number'] = self.dataframe['phone_number'].str.replace('(0)', '', regex=False)
        self.dataframe.loc[:,'phone_number'] = self.dataframe['phone_number'].replace({r'\D+' : ''}, regex=True)
        self.dataframe = self.dataframe.set_index('index')
        self.dataframe.reset_index(drop=True, inplace=True)
        return self.dataframe
    
    def clean_and_convert_weight(self, weight):
        # Extract numeric part of the weight
        numeric_value = ''.join(filter(str.isdigit, str(weight)))
        # Extract unit part of the weight
        unit = ''.join(filter(str.isalpha, str(weight))).lower()
        if unit == "xg":
            quantity, weight_value, weight_unit = re.match(r'(\d+)\s*x\s*(\d+)\s*(\w+)', weight).groups()
            return round(float(quantity) * float(weight_value) / 1000.0, 2)
        elif unit == "oz":
            return round(float(numeric_value)/ 35.274,2)
        elif unit == "kg":
            return round(float(numeric_value),2)
        elif unit == "ml" or unit == "g" :
            return  round(float(numeric_value)/1000,2)

    
    def clean_and_convert_product_weights(self):
        # Clean and convert weights
        self.dataframe['weight'] = self.dataframe['weight'].apply(self.clean_and_convert_weight)
        self.dataframe = self.dataframe.dropna(subset=['weight'])
        self.dataframe.rename( columns={'Unnamed: 0':'index'}, inplace=True )
        self.dataframe = self.dataframe.set_index('index')
        self.dataframe.loc[:,'date_added'] = pd.to_datetime(self.dataframe['date_added'].apply(parse))
        return self.dataframe
    
    def clean_orders_data(self):
        self.dataframe.drop('level_0', axis=1, inplace=True)
        self.dataframe.drop('first_name', axis=1, inplace=True)
        self.dataframe.drop('last_name', axis=1, inplace=True)
        self.dataframe.drop('1', axis=1, inplace=True)
        return self.dataframe

# **SQL**

In [363]:
!pip install jupysql --quiet

In [13]:
%load_ext sql

In [82]:
%config SqlMagic.displaylimit = 30

In [14]:
%sql postgresql://postgres:admin123@localhost/sales_data

Connecting to 'postgresql://postgres:***@localhost/sales_data'

# **Orders**

In [261]:
RDS_AWS_database = DatabaseConnector('db_creds.yaml')
orders_df = RDS_AWS_database.read_rds_table('orders_table')
cleaned_orders_df = DataCleaning(orders_df).clean_orders_data()
cleaned_orders_df

,date_uuid,user_uuid,card_number,store_code,product_code,product_quantity
index,,,,,,
0,9476f17e-5d6a-4117-874d-9cdb38ca1fa6,93caf182-e4e9-4c6e-bebb-60a1a9dcf9b8,30060773296197,BL-8387506C,R7-3126933h,3
1,0423a395-a04d-4e4a-bd0f-d237cbd5a295,8fe96c3a-d62d-4eb5-b313-cf12d9126a49,349624180933183,WEB-1388012W,C2-7287916l,2
2,65187294-bb16-4519-adc0-787bbe423970,fc461df4-b919-48b2-909e-55c95a03fe6b,3529023891650490,CH-01D85C8D,S7-1175877v,2
3,579e21f7-13cb-436b-83ad-33687a4eb337,6104719f-ef14-4b09-bf04-fb0c4620acb0,213142929492281,CL-C183BE4B,D8-8421505n,2
4,00ab86c3-2039-4674-b9c1-adbcbbf525bd,9523a6d3-b2dd-4670-a51a-36aebc89f579,502067329974,SO-B5B9CB3B,B6-2596063a,2
...,...,...,...,...,...,...
110548,f0e8fff6-9998-4661-954b-0e258e09d33c,95c74b0a-d495-4359-b1c0-e2da511e8403,575421945446,KA-FA7ED3B8,C9-6827622o,4
82164,1c80940a-d186-4ba9-9daa-8abd1aceae32,5d6fa6fe-e583-4baf-8bbb-d1dd6e2b551f,4971858637664481,WA-A41DA979,I0-1146408B,1
97599,58598aca-049c-418e-8e39-46327634a7f1,48b7f1fc-db13-4611-ad8e-3dac0b759488,4971858637664481,WEB-1388012W,A4-5443400b,4
106591,3a76f661-0707-4fbc-9862-f21d3249f581,51c0b538-7ded-4697-8e84-9f7aa13f9112,4971858637664481,SO-6D328417,E9-2782979e,4
118804,98fdc8b3-f619-4471-86b4-f44c26880166,e74907ca-1a4a-476c-a3ca-6b898b0964c2,4971858637664481,SO-6D328417,m0-0281207X,3

In [262]:
DatabaseConnector(yaml_file='db_creds_new.yaml').upload_to_db('orders_table', cleaned_orders_df )

CODE: 200 SUCCESS!

In [263]:
%%sql
ALTER TABLE orders_table
ALTER COLUMN product_quantity TYPE SMALLINT;

ALTER TABLE orders_table
ALTER COLUMN product_code TYPE VARCHAR(255);

ALTER TABLE orders_table
ALTER COLUMN store_code TYPE VARCHAR(255);

ALTER TABLE orders_table
ALTER COLUMN card_number TYPE VARCHAR(255);

ALTER TABLE orders_table
ALTER COLUMN user_uuid TYPE UUID USING user_uuid::UUID;

ALTER TABLE orders_table
ALTER COLUMN date_uuid TYPE UUID USING date_uuid::UUID;

Running query in 'postgresql://postgres:***@localhost/sales_data'

++
||
++
++

# **Users**

In [76]:
RDS_AWS_engine = DatabaseConnector('db_creds.yaml').db_engine
user_data_df = DataExtractor().read_rds_table('legacy_users', RDS_AWS_engine)
cleaned_user_df = DataCleaning(user_data_df).clean_user_data()
cleaned_user_df

,first_name,last_name,date_of_birth,company,email_address,address,country,country_code,phone_number,join_date,user_uuid
0,Sigfried,Noack,1990-09-30,Heydrich Junitz KG,rudi79@winkler.de,Zimmerstr. 1/0\n59015 Gießen,Germany,DE,49047905356,2018-10-10,93caf182-e4e9-4c6e-bebb-60a1a9dcf9b8
1,Guy,Allen,1940-12-01,Fox Ltd,rhodesclifford@henderson.com,Studio 22a\nLynne terrace\nMcCarthymouth\nTF0 9GH,United Kingdom,GB,01614960674,2001-12-20,8fe96c3a-d62d-4eb5-b313-cf12d9126a49
2,Harry,Lawrence,1995-08-02,"Johnson, Jones and Harris",glen98@bryant-marshall.co.uk,92 Ann drive\nJoanborough\nSK0 6LR,United Kingdom,GB,441214960340,2016-12-16,fc461df4-b919-48b2-909e-55c95a03fe6b
3,Darren,Hussain,1972-09-23,Wheeler LLC,daniellebryan@thompson.org,19 Robinson meadow\nNew Tracy\nW22 2QG,United Kingdom,GB,03069990871,2004-02-23,6104719f-ef14-4b09-bf04-fb0c4620acb0
4,Garry,Stone,1952-12-20,Warner Inc,billy14@long-warren.com,3 White pass\nHunterborough\nNN96 4UE,United Kingdom,GB,01214960225,2006-09-01,9523a6d3-b2dd-4670-a51a-36aebc89f579
...,...,...,...,...,...,...,...,...,...,...,...
15279,Stephen,Jenkins,1943-08-09,"Thornton, Carroll and Newman",s.jenkins@smith.com,Studio 41I\nJones lodge\nOliviaborough\nE8 3DU,United Kingdom,GB,44292018946,2016-04-15,2bd3a12f-a92d-4cdd-b99c-fc70572db302
15280,Stephen,Smith,1948-08-20,Robinson-Harris,s.smith@smith.com,530 Young parkway\nMillsfurt\nL4G 7NX,United Kingdom,GB,441144960977,2020-07-20,d234c04b-c07c-46a5-a902-526f91478ecc
15281,Stephen,Losekann,1940-10-09,Rosenow,s.losekann@smith.com,Viviane-Fritsch-Straße 3/5\n15064 Bad Liebenwerda,Germany,DE,0298408192,2021-03-07,1a0a8b7b-7c17-42d8-a946-8a85d5495651
15282,Stephen,Rivera,1952-06-04,"Taylor, Fry and Jones",s.rivera@smith.com,"660 Ross Falls Suite 357\nAnthonymouth, MA 09610",United States,US,2397113836,2011-01-03,187fe06e-bd5f-4381-af2f-d7ac37ca7572
15283,Stephen,Duncan,1994-03-27,"Phillips, Brown and Powell",s.duncan@smith.com,Studio 4\nHancock road\nPhillipsview\nST1X 3XB,United Kingdom,GB,441314960870,2015-08-28,0589bbca-1d58-4b1f-9d0a-04ed4c57aaa1

In [59]:
%%sql
ALTER TABLE dim_users
ALTER COLUMN first_name TYPE VARCHAR(255);

ALTER TABLE dim_users
ALTER COLUMN last_name TYPE VARCHAR(255);

ALTER TABLE dim_users
ALTER COLUMN date_of_birth TYPE DATE;

ALTER TABLE dim_users
ALTER COLUMN country_code TYPE VARCHAR(2);

ALTER TABLE dim_users
ALTER COLUMN user_uuid TYPE UUID USING user_uuid::UUID;

ALTER TABLE dim_users
ALTER COLUMN join_date TYPE DATE;

Running query in 'postgresql://postgres:***@localhost/sales_data'

++
||
++
++

In [320]:
DatabaseConnector(yaml_file='db_creds_new.yaml').upload_to_db('dim_users', cleaned_user_df )

CODE: 200 SUCCESS!

# **Stores**

In [335]:
store_data_df = DataExtractor().retrieve_all_store_data()
cleaned_store_df = DataCleaning(store_data_df).clean_store_data()
cleaned_store_df.reset_index(drop=True, inplace=True)
cleaned_store_df

,address,longitude,locality,store_code,staff_numbers,opening_date,store_type,latitude,country_code,continent
0,N/A,N/A,N/A,WEB-1388012W,325,2010-06-12,Web Portal,None,GB,Europe
1,"Flat 72W\nSally isle\nEast Deantown\nE7B 8EB, ...",51.62907,High Wycombe,HI-9B97EE4E,34,1996-10-25,Local,-0.74934,GB,Europe
2,"Heckerstraße 4/5\n50491 Säckingen, Landshut",48.52961,Landshut,LA-0772C7B9,92,2013-04-12,Super Store,12.16179,DE,Europe
3,"5 Harrison tunnel\nSouth Lydia\nWC9 2BE, Westbury",51.26,Westbury,WE-1DE82CEE,69,2014-01-02,Super Store,-2.1875,GB,Europe
4,Studio 6\nStephen landing\nSouth Simon\nB77 2W...,53.0233,Belper,BE-18074576,35,2019-09-09,Local,-1.48119,GB,Europe
...,...,...,...,...,...,...,...,...,...,...
431,"Flat 7\nStephanie lake\nMorrisside\nHP8 8LH, C...",50.76306,Cowes,CO-473A9FBB,94,2008-06-08,Super Store,-1.29772,GB,Europe
432,"Täschestraße 25\n39039 Nördlingen, Kirchlengern",52.2,Kirchlengern,KI-78096E8C,61,2005-05-12,Super Store,8.63333,DE,Europe
433,"Studio 8\nMoss mall\nWest Linda\nM0E 6XR, High...",51.62907,High Wycombe,HI-EEA7AE62,33,1998-05-14,Local,-0.74934,GB,Europe
434,"Baumplatz 6\n80114 Kötzting, Bretten",49.03685,Bretten,BR-662EC74C,35,2020-10-17,Local,8.70745,DE,Europe
435,"Gotthilf-Rose-Straße 7/3\n45457 Feuchtwangen, ...",50.64336,Bad Honnef,BA-B4AED588,36,2001-05-12,Local,7.2278,DE,Europe

In [63]:
%%sql

UPDATE dim_store_details
SET longitude = NULL
WHERE longitude = 'N/A';

UPDATE dim_store_details
SET latitude = NULL
WHERE latitude = 'N/A';

ALTER TABLE dim_store_details
ALTER COLUMN longitude TYPE FLOAT USING longitude::double precision;

ALTER TABLE dim_store_details
ALTER COLUMN locality TYPE VARCHAR(255);

ALTER TABLE dim_store_details
ALTER COLUMN store_code TYPE VARCHAR(255);

ALTER TABLE dim_store_details
ALTER COLUMN staff_numbers TYPE SMALLINT;

ALTER TABLE dim_store_details
ALTER COLUMN opening_date TYPE DATE;

ALTER TABLE dim_store_details
ALTER COLUMN store_type TYPE VARCHAR(255);

ALTER TABLE dim_store_details
ALTER COLUMN latitude TYPE FLOAT USING latitude::double precision;

ALTER TABLE dim_store_details
ALTER COLUMN country_code TYPE VARCHAR(255);

ALTER TABLE dim_store_details
ALTER COLUMN continent TYPE VARCHAR(255);

Running query in 'postgresql://postgres:***@localhost/sales_data'

1 rows affected.

++
||
++
++

# **Products**

In [75]:
data_extractor = DataExtractor()
s3_address = 's3://data-handling-public/products.csv'
products_df = data_extractor.extract_from_s3(s3_address)
cleaned_products_df = DataCleaning(products_df).clean_and_convert_product_weights()
cleaned_products_df

,product_name,product_price,weight,category,EAN,date_added,uuid,removed,product_code
index,,,,,,,,,
0,FurReal Dazzlin' Dimples My Playful Dolphin,£39.99,16.00,toys-and-games,7425710935115,2005-12-02,83dc0a69-f96f-4c34-bcb7-928acae19a94,Still_avaliable,R7-3126933h
1,Tiffany's World Day Out At The Park,£12.99,48.00,toys-and-games,487128731892,2006-01-09,712254d7-aea7-4310-aff8-8bcdd0aec7ff,Still_avaliable,C2-7287916l
2,Tiffany's World Pups Picnic Playset,£7.00,0.59,toys-and-games,1945816904649,1997-03-29,b089ef6f-b628-4e37-811d-fffe0102ba64,Still_avaliable,S7-1175877v
3,Tiffany's World Wildlife Park Adventures,£12.99,0.54,toys-and-games,1569790890899,2013-03-20,d55de422-8b98-47d6-9991-e4bc4c5c0cb0,Removed,D8-8421505n
4,Cosatto Cosy Dolls Pram,£30.00,191.00,toys-and-games,7142740213920,2007-12-23,7945b657-cb02-4cc5-96cf-f65ed0a8f235,Still_avaliable,B6-2596063a
...,...,...,...,...,...,...,...,...,...
1848,Goodmans Qi Autosense In Car Phone Holder,£15.00,0.12,diy,8185827751600,2020-08-28,3ff21cb1-8e90-499d-b5a0-6839fb83e70f,Still_avaliable,x4-2227164k
1849,Goodmans Qi Wireless Charging Phone Stand,£15.00,0.13,diy,9769724533935,2012-05-20,a7910f74-c2b6-4144-98b7-30ca68f34d2d,Still_avaliable,i3-8338545Z
1850,RAC 12V Wet & Dry Vacuum,£18.00,0.82,diy,3113855860327,1993-11-28,66d3efa0-f480-4da9-893b-e8aaff53e27b,Still_avaliable,n4-1642658b
1851,Goodmans Qi Autosense In Car Phone Holder,£15.00,0.12,diy,9195087467400,2016-09-20,efb472f1-8f00-448e-a874-9fa9812eeab5,Still_avaliable,A3-7619070S
1852,Beldray Telescopic Ladder 2.9m,£69.00,94.00,diy,8518402353072,2006-10-07,cfe701da-6493-4a7f-83cf-9aab1650f689,Still_avaliable,i6-2851854w

In [320]:
DatabaseConnector(yaml_file='db_creds_new.yaml').upload_to_db('dim_products', cleaned_products_df)

CODE: 200 SUCCESS!

### Remove £ from the product_price column

In [137]:
%%sql
UPDATE dim_products
SET
  product_price = REPLACE (product_price, '£', '');

Running query in 'postgresql://postgres:***@localhost/sales_data'

1846 rows affected.

++
||
++
++

### Adding weight class column

In [138]:
%%sql
ALTER TABLE dim_products
ADD COLUMN weight_class VARCHAR(255);

Running query in 'postgresql://postgres:***@localhost/sales_data'

++
||
++
++

In [139]:
%%sql
UPDATE dim_products
SET
  weight_class = CASE
    WHEN weight < 2 THEN 'Light'
    WHEN weight >= 2
    AND weight < 40 THEN 'Mid_Sized'
    WHEN weight >= 40
    AND weight < 140 THEN 'Heavy'
    ELSE 'Truck_Required'
  END;

Running query in 'postgresql://postgres:***@localhost/sales_data'

1846 rows affected.

++
||
++
++

### name changed to still_available

In [143]:
%%sql
ALTER TABLE dim_products RENAME removed TO still_available;

Running query in 'postgresql://postgres:***@localhost/sales_data'

++
||
++
++

### Change entries to be represented with True and False Statements

In [143]:
%%sql
UPDATE dim_products
SET
  still_available = CASE
    WHEN still_available = 'Still_avaliable' THEN TRUE
    WHEN still_available = 'Removed' THEN FALSE
    ELSE still_available
  END;

Running query in 'postgresql://postgres:***@localhost/sales_data'

++
||
++
++

# **Date Times**

In [332]:
def extract_from_s3():
    s3 = boto3.client('s3')
    response = s3.get_object(Bucket='data-handling-public', Key='date_details.json')
    data = response['Body']
    df = pd.read_json(data)

    return df

date_times_df = extract_from_s3()
# removes string in month column
date_times_df = date_times_df[date_times_df['month'].str.isnumeric()]
# converts column values to int
date_times_df['year'] = date_times_df['year'].astype('int')
date_times_df['month'] = date_times_df['month'].astype('int')
date_times_df['day'] = date_times_df['day'].astype('int')

date_times_df

,timestamp,month,year,day,time_period,date_uuid
0,22:00:06,9,2012,19,Evening,3b7ca996-37f9-433f-b6d0-ce8391b615ad
1,22:44:06,2,1997,10,Evening,adc86836-6c35-49ca-bb0d-65b6507a00fa
2,10:05:37,4,1994,15,Morning,5ff791bf-d8e0-4f86-8ceb-c7b60bef9b31
3,17:29:27,11,2001,6,Midday,1b01fcef-5ab9-404c-b0d4-1e75a0bd19d8
4,22:40:33,12,2015,31,Evening,dfa907c1-f6c5-40f0-aa0d-40ed77ac5a44
...,...,...,...,...,...,...
120156,22:56:56,11,2022,12,Evening,d6c4fb31-720d-4e94-aa6b-dcbcb85f2bb7
120157,18:25:20,5,1997,31,Evening,f7722027-1aae-49c3-8f8d-853e93f9f3e6
120158,18:21:40,9,2011,13,Evening,4a3b9851-52e1-463c-ac81-1960f141444e
120159,19:10:53,7,2013,12,Evening,64974909-0d4b-42a2-822a-73b5695e8bfb
120160,21:17:12,3,2008,18,Evening,55c228c7-14ee-4d46-99a9-01dfc57d1adf

In [362]:
DatabaseConnector(yaml_file='db_creds_new.yaml').upload_to_db('dim_date_times', date_times_df )

CODE: 200 SUCCESS!

In [ ]:
%%sql
ALTER TABLE dim_date_times
ALTER COLUMN month TYPE VARCHAR(255);

ALTER TABLE dim_date_times
ALTER COLUMN year TYPE VARCHAR(255);

ALTER TABLE dim_date_times
ALTER COLUMN day TYPE VARCHAR(255);

ALTER TABLE dim_date_times
ALTER COLUMN time_period TYPE VARCHAR(255);

ALTER TABLE dim_date_times
ALTER COLUMN date_uuid TYPE UUID USING date_uuid::UUID;

Running query in 'postgresql://postgres:***@localhost/sales_data'

++
||
++
++

In [157]:
%%sql
ALTER TABLE dim_products
ALTER COLUMN product_price TYPE FLOAT USING product_price::FLOAT;

ALTER TABLE dim_products
ALTER COLUMN weight TYPE FLOAT;

ALTER TABLE dim_products
ALTER COLUMN "EAN" TYPE VARCHAR(255);

ALTER TABLE dim_products
ALTER COLUMN product_code TYPE VARCHAR(255);

ALTER TABLE dim_products
ALTER COLUMN date_added TYPE DATE;

ALTER TABLE dim_products
ALTER COLUMN uuid TYPE UUID USING uuid::UUID;

ALTER TABLE dim_products
ALTER COLUMN still_available TYPE BOOL USING still_available::boolean;

ALTER TABLE dim_products
ALTER COLUMN weight_class TYPE VARCHAR(255);

Running query in 'postgresql://postgres:***@localhost/sales_data'

++
||
++
++

# **Card Details**

In [318]:
pdf_df=DataExtractor().retrieve_pdf_data('card_details.pdf')
cleaned_df_cards = DataCleaning(pdf_df).clean_card_data()
cleaned_df_cards

,card_number,expiry_date,card_provider,date_payment_confirmed
0,30060773296197,2026-09-01,Diners Club / Carte Blanche,2015-11-25
1,349624180933183,2023-10-01,American Express,2001-06-18
2,3529023891650490,2023-06-01,JCB 16 digit,2000-12-26
3,213142929492281,2027-09-01,JCB 15 digit,2011-02-12
4,502067329974,2025-10-01,Maestro,1997-03-13
...,...,...,...,...
14,180036921556789,2028-12-01,JCB 15 digit,1997-06-06
15,180018030448512,2024-11-01,JCB 15 digit,2004-06-16
16,3569953313547220,2024-04-01,JCB 16 digit,2020-02-05
17,4444521712606810,2027-06-01,VISA 16 digit,2008-06-16
18,372031786522735,2030-02-01,American Express,2009-02-04

In [327]:
%%sql
ALTER TABLE dim_card_details
ALTER COLUMN card_number TYPE VARCHAR(255);

ALTER TABLE dim_card_details
ALTER COLUMN expiry_date TYPE VARCHAR(255);

ALTER TABLE dim_card_details
ALTER COLUMN date_payment_confirmed TYPE DATE USING date_payment_confirmed::date;

Running query in 'postgresql://postgres:***@localhost/sales_data'

++
||
++
++

# **Primary Keys**

In [167]:
%%sql
ALTER TABLE dim_users ADD PRIMARY KEY (user_uuid);

ALTER TABLE dim_store_details ADD PRIMARY KEY (store_code);

ALTER TABLE dim_products ADD PRIMARY KEY (product_code);

ALTER TABLE dim_date_times ADD PRIMARY KEY (date_uuid);

ALTER TABLE dim_store_details ADD PRIMARY KEY (store_code);

ALTER TABLE dim_card_details ADD PRIMARY KEY (card_number);

Running query in 'postgresql://postgres:***@localhost/sales_data'

++
||
++
++

# **Foreign Keys**

In [65]:
%%sql

ALTER TABLE orders_table ADD CONSTRAINT fk_user_uuid FOREIGN KEY (user_uuid) REFERENCES dim_users (user_uuid);

ALTER TABLE orders_table ADD CONSTRAINT fk_product_code FOREIGN KEY (product_code) REFERENCES dim_products (product_code);

ALTER TABLE orders_table ADD CONSTRAINT fk_date_uuid FOREIGN KEY (date_uuid) REFERENCES dim_date_times (date_uuid);

ALTER TABLE orders_table ADD CONSTRAINT fk_card_number FOREIGN KEY (card_number) REFERENCES dim_card_details (card_number);

ALTER TABLE orders_table ADD CONSTRAINT fk_store_code FOREIGN KEY (store_code) REFERENCES dim_store_details (store_code);

Running query in 'postgresql://postgres:***@localhost/sales_data'

++
||
++
++

# **Querying The Data**

### **Task 1: How many stores does the business have and in which countries?**

In [69]:
%%sql
SELECT
  country_code,
  COUNT(country_code)
FROM
  dim_store_details
GROUP BY
  country_code;

Running query in 'postgresql://postgres:***@localhost/sales_data'

3 rows affected.

+--------------+-------+
| country_code | count |
+--------------+-------+
|      DE      |  141  |
|      US      |   34  |
|      GB      |  266  |
+--------------+-------+

### **Task 2: Which locations currently have the most stores?**

In [68]:
%%sql

SELECT locality, COUNT(locality) AS total_no_stores
FROM dim_store_details 
GROUP BY locality
ORDER BY total_no_stores DESC, locality
LIMIT 7;

Running query in 'postgresql://postgres:***@localhost/sales_data'

7 rows affected.

+--------------+-----------------+
|   locality   | total_no_stores |
+--------------+-----------------+
|  Chapletown  |        14       |
|    Belper    |        13       |
|    Bushey    |        12       |
|    Exeter    |        11       |
|   Arbroath   |        10       |
| High Wycombe |        10       |
|  Rutherglen  |        10       |
+--------------+-----------------+

In [320]:
DatabaseConnector(yaml_file='db_creds_new.yaml').upload_to_db('dim_card_details', cleaned_df_cards )

CODE: 200 SUCCESS!

### **Task 3: Which months produced the largest amount of sales?**

In [67]:
%%sql
SELECT
    ROUND(SUM(orders_table.product_quantity * dim_products.product_price)::numeric, 2) AS total_sales, dim_date_times.month
FROM
    orders_table
JOIN
    dim_date_times ON orders_table.date_uuid = dim_date_times.date_uuid
JOIN
    dim_products ON orders_table.product_code = dim_products.product_code
GROUP BY
    dim_date_times.month
ORDER BY
    total_sales DESC
LIMIT 6;

Running query in 'postgresql://postgres:***@localhost/sales_data'

6 rows affected.

+-------------+-------+
| total_sales | month |
+-------------+-------+
|  673295.68  |   8   |
|  668041.45  |   1   |
|  657335.84  |   10  |
|  650321.43  |   5   |
|  645741.70  |   7   |
|  645463.00  |   3   |
+-------------+-------+

### **Task 4: How many sales are coming from online?**

In [66]:
%%sql
SELECT 

COUNT(orders_table.product_quantity) AS numbers_of_sales,
SUM(orders_table.product_quantity) AS product_quantity_count,

CASE

WHEN dim_store_details.store_type = 'Web Portal' THEN 'web'
ELSE 'offline' 
END as location

FROM orders_table

JOIN
    dim_store_details ON orders_table.store_code = dim_store_details.store_code
GROUP BY
    location
ORDER BY
    numbers_of_sales;

Running query in 'postgresql://postgres:***@localhost/sales_data'

2 rows affected.

+------------------+------------------------+----------+
| numbers_of_sales | product_quantity_count | location |
+------------------+------------------------+----------+
|      26957       |         107739         |   web    |
|      93166       |         374047         | offline  |
+------------------+------------------------+----------+

In [62]:
DatabaseConnector(yaml_file='db_creds_new.yaml').upload_to_db('dim_store_details', cleaned_store_df )

CODE: 200 SUCCESS!

### **Task 5: What percentage of sales come through each type of store?**

In [70]:
%%sql
SELECT
    dim_store_details.store_type AS store_type,
    ROUND(SUM(orders_table.product_quantity * dim_products.product_price)::numeric, 2) AS total_sales,
    ROUND((SUM(orders_table.product_quantity * dim_products.product_price)/
        (SELECT 
            SUM(orders_table.product_quantity * dim_products.product_price)
        FROM 
            orders_table
        JOIN dim_products ON orders_table.product_code = dim_products.product_code) * 100)::numeric, 2) 
    AS "percentage_total(%)"
FROM 
    orders_table
JOIN 
    dim_products ON orders_table.product_code = dim_products.product_code
JOIN 
    dim_store_details ON orders_table.store_code = dim_store_details.store_code
GROUP BY
    store_type
ORDER BY
    "percentage_total(%)" DESC;

Running query in 'postgresql://postgres:***@localhost/sales_data'

5 rows affected.

+-------------+-------------+---------------------+
|  store_type | total_sales | percentage_total(%) |
+-------------+-------------+---------------------+
|    Local    |  3440896.52 |        44.56        |
|  Web Portal |  1726547.05 |        22.36        |
| Super Store |  1224293.65 |        15.85        |
|  Mall Kiosk |  698791.61  |         9.05        |
|    Outlet   |  631804.81  |         8.18        |
+-------------+-------------+---------------------+

### **Task 6: Which month in each year produced the highest cost of sales?**

In [71]:
%%sql

SELECT
    ROUND(SUM(orders_table.product_quantity * dim_products.product_price)::numeric, 2) AS total_sales,
    dim_date_times.year AS year,
    dim_date_times.month AS month
FROM 
    orders_table
JOIN 
    dim_products ON orders_table.product_code = dim_products.product_code
JOIN 
    dim_date_times ON orders_table.date_uuid = dim_date_times.date_uuid
GROUP BY
    year, month
ORDER BY
    total_sales DESC
LIMIT 10;

Running query in 'postgresql://postgres:***@localhost/sales_data'

10 rows affected.

+-------------+------+-------+
| total_sales | year | month |
+-------------+------+-------+
|   27936.77  | 1994 |   3   |
|   27356.14  | 2019 |   1   |
|   27091.67  | 2009 |   8   |
|   26679.98  | 1997 |   11  |
|   26310.97  | 2018 |   12  |
|   26277.72  | 2019 |   8   |
|   26236.67  | 2017 |   9   |
|   25798.12  | 2010 |   5   |
|   25648.29  | 1996 |   8   |
|   25614.54  | 2000 |   1   |
+-------------+------+-------+
Truncated to displaylimit of 10.

### **Task 7: What is our staff headcount?**

In [72]:
%%sql
SELECT
    SUM(staff_numbers) AS total_staff_numbers,
    country_code as country_code
FROM   
    dim_store_details
GROUP BY
    country_code
ORDER BY
    total_staff_numbers DESC;

Running query in 'postgresql://postgres:***@localhost/sales_data'

3 rows affected.

+---------------------+--------------+
| total_staff_numbers | country_code |
+---------------------+--------------+
|        13307        |      GB      |
|         6123        |      DE      |
|         1384        |      US      |
+---------------------+--------------+

### **Task 8: Which German store type is selling the most?**

In [73]:
%%sql
SELECT
    ROUND(SUM(orders_table.product_quantity * dim_products.product_price)::numeric, 2) AS total_sales,
    dim_store_details.store_type AS store_type,
    dim_store_details.country_code AS country_code
FROM 
    orders_table
JOIN 
    dim_products ON orders_table.product_code = dim_products.product_code
JOIN 
    dim_store_details ON orders_table.store_code = dim_store_details.store_code
WHERE 
    dim_store_details.country_code = 'DE'
GROUP BY
    store_type, country_code 
ORDER BY
    total_sales ASC;

Running query in 'postgresql://postgres:***@localhost/sales_data'

4 rows affected.

+-------------+-------------+--------------+
| total_sales |  store_type | country_code |
+-------------+-------------+--------------+
|  198373.57  |    Outlet   |      DE      |
|  247634.20  |  Mall Kiosk |      DE      |
|  384625.03  | Super Store |      DE      |
|  1109909.59 |    Local    |      DE      |
+-------------+-------------+--------------+

### **Task 9: How quickly is the company making sales?**

In [74]:
%%sql
WITH sales_date AS (
    SELECT 
        year,
        sales_date_column,
        LEAD(sales_date_column) OVER (PARTITION BY year ORDER BY sales_date_column) - sales_date_column AS time_between_sales
    FROM (
        SELECT 
            year,
            (CONCAT(year, '-', month, '-', day, ' ', timestamp))::TIMESTAMP AS sales_date_column
        FROM 
            dim_date_times
    )

)
SELECT 
    year,
    AVG(time_between_sales) AS average_time_taken
FROM 
    sales_date
GROUP BY 
    year
ORDER BY 
    average_time_taken DESC
LIMIT 5;

Running query in 'postgresql://postgres:***@localhost/sales_data'

5 rows affected.

+------+--------------------+
| year | average_time_taken |
+------+--------------------+
| 2013 |   2:17:13.712533   |
| 1993 |   2:15:35.481806   |
| 2002 |   2:13:39.915690   |
| 2008 |   2:13:03.770202   |
| 2022 |   2:13:02.003698   |
+------+--------------------+